Revit 2024 API
SymbolTypeId.KN Property
 Symbol kN, indicating unit Kilonewtons.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId KN { get; }
Visual Basic
Public Shared ReadOnly Property KN As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ KN {
	ForgeTypeId^ get ();
}
See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace